Repository: AChep/keyguard-app
Catalog: appleUi/Sources/KeyguardUI/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hu, it, ja, ko, pt_br, pt_pt, ru, uk, zh_hans

# gpg_tools_operation_decrypt_text
source: Decrypt text or files with stored private keys
ar: فك تشفير النصوص أو الملفات باستخدام المفاتيح الخاصة المخزّنة
de: Text oder Dateien mit gespeicherten privaten Schlüsseln entschlüsseln
es: Descifrar texto o archivos con las claves privadas almacenadas
fr: Déchiffrez du texte ou des fichiers avec les clés privées stockées
it: Decrittografa testo o file con le chiavi private memorizzate
ja: 保存済みの秘密鍵でテキストまたはファイルを復号します
ko: 저장된 개인 키로 텍스트나 파일을 복호화합니다
pt_br: Descriptografar texto ou arquivos com chaves privadas armazenadas
pt_pt: Desencriptar textos ou ficheiros com chaves privadas armazenadas
ru: Расшифровка текста или файлов с помощью сохранённых секретных ключей
uk: Розшифрувати текст або файли за допомогою збережених секретних ключів
zh_hans: 使用存储的私钥解密文本或文件

# gpg_tools_operation_encrypt_text
source: Encrypt text or files for selected recipients
ar: تشفير النصوص أو الملفات للمستلمين المحددين
de: Text oder Dateien für ausgewählte Empfänger verschlüsseln
es: Cifrar texto o archivos para los destinatarios seleccionados
fr: Chiffrez du texte ou des fichiers pour les destinataires sélectionnés
it: Crittografa testo o file per i destinatari selezionati
ja: 選択した受信者向けにテキストまたはファイルを暗号化します
ko: 선택한 수신자를 위해 텍스트나 파일을 암호화합니다
pt_br: Criptografar texto ou arquivos para os destinatários selecionados
pt_pt: Encriptar texto ou ficheiros para destinatários selecionados
ru: Шифрование текста или файлов для выбранных получателей
uk: Зашифрувати текст або файли для вибраних отримувачів
zh_hans: 为选定的收件人加密文本或文件

# gpg_tools_operation_sign_text
source: Sign text or files with a stored private key
ar: توقيع النصوص أو الملفات باستخدام مفتاح خاص مخزّن
de: Text oder Dateien mit einem gespeicherten privaten Schlüssel signieren
es: Firmar texto o archivos con una clave privada almacenada
fr: Signez du texte ou des fichiers avec une clé privée stockée
it: Firma testo o file con una chiave privata memorizzata
ja: 保存済みの秘密鍵でテキストまたはファイルに署名します
ko: 저장된 개인 키로 텍스트나 파일에 서명합니다
pt_br: Assinar texto ou arquivos com uma chave privada armazenada
pt_pt: Assine textos ou ficheiros com uma chave privada guardada
ru: Подписание текста или файлов с помощью сохранённого секретного ключа
uk: Підписати текст або файли за допомогою збереженого секретного ключа
zh_hans: 使用存储的私钥签名文本或文件

# gpg_tools_operation_verify_text
source: Verify inline or detached signatures
ar: التحقق من التوقيعات المضمّنة أو المنفصلة
de: Inline- oder abgetrennte Signaturen überprüfen
es: Verificar firmas en línea o separadas
fr: Vérifiez les signatures intégrées ou détachées
it: Verifica firme in linea o separate
ja: インラインまたは分離署名を検証します
ko: 인라인 또는 분리형 서명을 검증합니다
pt_br: Verificar assinaturas embutidas (inline) ou destacadas (detached)
pt_pt: Verificar assinaturas embutidas ou separadas
ru: Проверка встроенных или отделённых подписей
uk: Перевірити вбудовані або відокремлені підписи
zh_hans: 验证内联签名或分离签名

# gpg_tools_pasted_public_key_label
source: Public key
ar: المفتاح العام
de: Öffentlicher Schlüssel
es: Clave pública
fr: Clé publique
it: Chiave pubblica
ja: 公開鍵
ko: 공개 키
pt_br: Chave pública
pt_pt: Chave pública
ru: Открытый ключ
uk: Відкритий ключ
zh_hans: 公钥

# gpg_tools_pasted_public_key_placeholder
source: Paste an armored public key block
ar: الصق كتلة مفتاح عام مُدرَّعة
de: Fügen Sie einen ASCII-Armor-Block eines öffentlichen Schlüssels ein
es: Pegue un bloque de clave pública blindada
fr: Collez un bloc de clé publique en armure ASCII
it: Incolla un blocco di chiave pubblica armored
ja: ASCII アーマー形式の公開鍵ブロックを貼り付けてください
ko: armored 공개 키 블록을 붙여넣으세요
pt_br: Cole um bloco de chave pública blindada (armored)
pt_pt: Cole um bloco de chave pública blindada
ru: Вставьте блок открытого ключа в ASCII-броне
uk: Вставте блок відкритого ключа у форматі ASCII armor
zh_hans: 粘贴 ASCII 封装的公钥块

# gpg_tools_public_key_add
source: Add a public key
ar: إضافة مفتاح عام
de: Öffentlichen Schlüssel hinzufügen
es: Añadir una clave pública
fr: Ajouter une clé publique
it: Aggiungi una chiave pubblica
ja: 公開鍵を追加
ko: 공개 키 추가
pt_br: Adicionar chave pública
pt_pt: Adicionar uma chave pública
ru: Добавить открытый ключ
uk: Додати відкритий ключ
zh_hans: 添加公钥

# gpg_tools_public_key_description
source: Paste an armored public key block to use for this operation. It is used in addition to your stored keys.
ar: الصق كتلة مفتاح عام مُدرَّعة لاستخدامها في هذه العملية. تُستخدم بالإضافة إلى مفاتيحك المخزّنة.
de: Fügen Sie einen ASCII-Armor-Block eines öffentlichen Schlüssels ein, der für diesen Vorgang verwendet werden soll. Er wird zusätzlich zu Ihren gespeicherten Schlüsseln verwendet.
es: Pegue un bloque de clave pública blindada para usar en esta operación. Se usa además de sus claves almacenadas.
fr: Collez un bloc de clé publique en armure ASCII à utiliser pour cette opération. Elle est utilisée en plus de vos clés stockées.
it: Incolla un blocco di chiave pubblica armored da utilizzare per questa operazione. Viene usato in aggiunta alle tue chiavi memorizzate.
ja: この操作に使用する ASCII アーマー形式の公開鍵ブロックを貼り付けてください。保存済みのキーに加えて使用されます。
ko: 이 작업에 사용할 armored 공개 키 블록을 붙여넣으세요. 저장된 키에 더해 함께 사용됩니다.
pt_br: Cole um bloco de chave pública blindada (armored) para usar nesta operação. Ela será utilizada em conjunto com as chaves já armazenadas.
pt_pt: Cole um bloco de chave pública blindada para utilizar nesta operação. Será usado em conjunto com as suas chaves armazenadas.
ru: Вставьте блок открытого ключа в ASCII-броне для использования в этой операции. Он используется в дополнение к вашим сохранённым ключам.
uk: Вставте блок відкритого ключа у форматі ASCII armor для використання в цій операції. Він використовується на додачу до ваших збережених ключів.
zh_hans: 粘贴用于此操作的 ASCII 封装公钥块。它将作为您存储密钥的补充使用。

# gpg_tools_public_key_invalid
source: Paste valid armored public certificates. Unsupported or incomplete input cannot be added.
ar: الصق شهادات عامة مُدرَّعة صالحة. لا يمكن إضافة إدخال غير مدعوم أو غير مكتمل.
fr: Coller des certificats publics avec armure valides. Une entrée non prise en charge ou incomplète ne peut pas être ajoutée.
pt_br: Cole certificados públicos blindados válidos. Entradas incompatíveis ou incompletas não podem ser adicionadas.
pt_pt: Cole certificados públicos blindados válidos. Não é possível adicionar dados de entrada não suportados ou incompletos.

# gpg_tools_public_key_not_encryptable
source: Every recipient must have a currently usable encryption key.
ar: يجب أن يمتلك كل مستلم مفتاح تشفير صالحًا حاليًا.
fr: Chaque destinataire doit avoir une clé de chiffrement actuellement utilisable.
pt_br: Cada destinatário deve ter uma chave de criptografia utilizável no momento.
pt_pt: Cada destinatário deve possuir uma chave de encriptação atualmente utilizável.

# gpg_tools_public_key_private
source: Paste public certificates only. Private keys cannot be added here.
ar: الصق الشهادات العامة فقط. لا يمكن إضافة المفاتيح الخاصة هنا.
fr: Coller uniquement les certificats publics. Les clés privées ne peuvent pas être ajoutées ici.
pt_br: Cole apenas certificados públicos. Chaves privadas não podem ser adicionadas aqui.
pt_pt: Cole apenas certificados públicos. Não é possível adicionar chaves privadas aqui.

# gpg_tools_public_key_title
source: Custom public key
ar: مفتاح عام مخصص
de: Benutzerdefinierter öffentlicher Schlüssel
es: Clave pública personalizada
fr: Clé publique personnalisée
it: Chiave pubblica personalizzata
ja: カスタム公開鍵
ko: 사용자 지정 공개 키
pt_br: Chave pública personalizada
pt_pt: Chave pública personalizada
ru: Пользовательский открытый ключ
uk: Користувацький відкритий ключ
zh_hans: 自定义公钥

# gpg_tools_run_success
source: GPG operation completed
ar: اكتملت عملية GPG
de: GPG-Vorgang abgeschlossen
es: Operación GPG completada
fr: Opération GPG terminée
it: Operazione GPG completata
ja: GPG 操作が完了しました
ko: GPG 작업이 완료되었습니다
pt_br: Operação GPG concluída
pt_pt: Operação GPG concluída
ru: Операция GPG завершена
uk: Операцію GPG завершено
zh_hans: GPG 操作已完成

# gpg_tools_scope_file
source: File
ar: ملف
de: Datei
es: Archivo
fr: Fichier
ja: ファイル
ko: 파일
pt_br: Arquivo
pt_pt: Ficheiro
ru: Файл
uk: Файл
zh_hans: 文件

# gpg_tools_scope_text
source: Text
ar: نص
es: Texto
fr: Texte
it: Testo
ja: テキスト
ko: 텍스트
pt_br: Texto
pt_pt: Texto
ru: Текст
uk: Текст
zh_hans: 文本

# gpg_tools_select_input_file
source: Input file
ar: ملف الإدخال
de: Eingabedatei
es: Archivo de entrada
fr: Fichier d'entrée
it: File di input
ja: 入力ファイル
ko: 입력 파일
pt_br: Arquivo de entrada
pt_pt: Ficheiro de entrada
ru: Входной файл
uk: Вхідний файл
zh_hans: 输入文件

# gpg_tools_select_recipients
source: Recipients
ar: المستلمون
de: Empfänger
es: Destinatarios
fr: Destinataires
it: Destinatari
ja: 受信者
ko: 수신자
pt_br: Destinatários
pt_pt: Destinatários
ru: Получатели
uk: Отримувачі
zh_hans: 收件人

# gpg_tools_select_signature_file
source: Signature file
ar: ملف التوقيع
de: Signaturdatei
es: Archivo de firma
fr: Fichier de signature
it: File della firma
ja: 署名ファイル
ko: 서명 파일
pt_br: Arquivo de assinatura
pt_pt: Ficheiro de assinatura
ru: Файл подписи
uk: Файл підпису
zh_hans: 签名文件

# gpg_tools_select_signing_key
source: Signing key
ar: مفتاح التوقيع
de: Signierschlüssel
es: Clave de firma
fr: Clé de signature
it: Chiave di firma
ja: 署名キー
ko: 서명 키
pt_br: Chave de assinatura
pt_pt: Chave de assinatura
ru: Ключ подписи
uk: Ключ для підпису
zh_hans: 签名密钥

# gpg_tools_sign_encrypted_message
source: Sign
ar: توقيع
de: Signieren
es: Firmar
fr: Signer
it: Firma
ja: 署名
ko: 서명
pt_br: Assinar
pt_pt: Assinar
ru: Подписать
uk: Підписати
zh_hans: 签名

# gpg_tools_sign_none
source: Don't sign
ar: عدم التوقيع
de: Nicht signieren
es: No firmar
fr: Ne pas signer
it: Non firmare
ja: 署名しない
ko: 서명 안 함
pt_br: Não assinar
pt_pt: Não assine
ru: Не подписывать
uk: Не підписувати
zh_hans: 不签名

# gpg_tools_signature_by
source: Signed by %1$@
ar: موقّع من %1$@
de: Signiert von %1$@
es: Firmado por %1$@
fr: Signé par %1$@
it: Firmato da %1$@
ja: %1$@ による署名
ko: %1$@이(가) 서명함
pt_br: Assinado por %1$@
pt_pt: Assinado por %1$@
ru: Подписано %1$@
uk: Підписано %1$@
zh_hans: 由 %1$@ 签名

# gpg_tools_signature_created_at
source: Created %1$@
ar: أُنشئ في %1$@
de: Erstellt am %1$@
es: Creada el %1$@
fr: Créé le %1$@
it: Creato il %1$@
ja: %1$@ に作成
ko: %1$@에 생성됨
pt_br: Criado por %1$@
pt_pt: Criado %1$@
ru: Создано %1$@
uk: Створено %1$@
zh_hans: 创建于 %1$@

# gpg_tools_signature_file_required
source: Choose a signature file
ar: اختر ملف توقيع
de: Wählen Sie eine Signaturdatei
es: Elija un archivo de firma
fr: Choisissez un fichier de signature
it: Scegli un file della firma
ja: 署名ファイルを選択してください
ko: 서명 파일을 선택하세요
pt_br: Escolher um arquivo de assinatura
pt_pt: Escolha um arquivo de assinatura
ru: Выберите файл подписи
uk: Виберіть файл підпису
zh_hans: 选择签名文件

# gpg_tools_signature_label
source: Signature
ar: التوقيع
de: Signatur
es: Firma
it: Firma
ja: 署名
ko: 서명
pt_br: Assinatura
pt_pt: Assinatura
ru: Подпись
uk: Підпис
zh_hans: 签名

# gpg_tools_signed_text_label
source: Signed text
ar: نص موقّع
de: Signierter Text
es: Texto firmado
fr: Texte signé
it: Testo firmato
ja: 署名されたテキスト
ko: 서명된 텍스트
pt_br: Texto assinado
pt_pt: Texto assinado
ru: Подписанный текст
uk: Підписаний текст
zh_hans: 已签名的文本

# gpg_tools_stored_public_keys_note
source: Stored public keys are used automatically for verification.
ar: تُستخدم المفاتيح العامة المخزّنة تلقائيًا للتحقق.
de: Gespeicherte öffentliche Schlüssel werden automatisch zur Überprüfung verwendet.
es: Las claves públicas almacenadas se usan automáticamente para la verificación.
fr: Les clés publiques stockées sont utilisées automatiquement pour la vérification.
it: Le chiavi pubbliche memorizzate vengono utilizzate automaticamente per la verifica.
ja: 保存済みの公開鍵が検証のために自動的に使用されます。
ko: 저장된 공개 키를 검증에 자동으로 사용합니다.
pt_br: As chaves públicas armazenadas são usadas automaticamente para verificação.
pt_pt: As chaves públicas armazenadas são utilizadas automaticamente para verificação.
ru: Сохранённые открытые ключи автоматически используются для проверки.
uk: Збережені відкриті ключі автоматично використовуються для перевірки.
zh_hans: 存储的公钥将自动用于验证。

# gpg_tools_text_required
source: Enter text to process
ar: أدخل النص المطلوب معالجته
de: Geben Sie den zu verarbeitenden Text ein
es: Introduzca el texto a procesar
fr: Saisissez le texte à traiter
it: Inserisci il testo da elaborare
ja: 処理するテキストを入力してください
ko: 처리할 텍스트를 입력하세요
pt_br: Digite o texto a ser processado
pt_pt: Digite o texto para processar
ru: Введите текст для обработки
uk: Введіть текст для обробки
zh_hans: 输入要处理的文本

# gpg_tools_valid_signature
source: Valid signature
ar: توقيع صالح
de: Gültige Signatur
es: Firma válida
fr: Signature valide
it: Firma valida
ja: 有効な署名
ko: 유효한 서명
pt_br: Assinatura válida
pt_pt: Assinatura válida
ru: Действительная подпись
uk: Дійсний підпис
zh_hans: 有效签名

# gpg_tools_warning_elgamal_decryption_key
source: Warning: message was decrypted with a legacy ElGamal key
ar: تحذير: تم فك تشفير الرسالة بمفتاح ElGamal قديم
fr: Attention : le message a été déchiffré avec une clé ElGamal héritée
pt_br: Aviso: a mensagem foi descriptografada com uma chave ElGamal herdada
pt_pt: Aviso: a mensagem foi desencriptada com uma chave ElGamal legada

# gpg_tools_warning_key_expired
source: Warning: signing key is expired
ar: تحذير: مفتاح التوقيع منتهي الصلاحية
de: Warnung: Signierschlüssel ist abgelaufen
es: Advertencia: la clave de firma ha caducado
fr: Avertissement : la clé de signature a expiré
it: Attenzione: la chiave di firma è scaduta
ja: 警告: 署名キーの有効期限が切れています
ko: 경고: 서명 키가 만료되었습니다
pt_br: Aviso: a chave de assinatura expirou
pt_pt: Aviso: a chave de assinatura expirou
ru: Предупреждение: срок действия ключа подписи истёк
uk: Попередження: термін дії ключа для підпису закінчився
zh_hans: 警告：签名密钥已过期

# gpg_tools_warning_key_revoked
source: Warning: signing key is revoked
ar: تحذير: مفتاح التوقيع مُبطَل
de: Warnung: Signierschlüssel ist widerrufen
es: Advertencia: la clave de firma está revocada
fr: Avertissement : la clé de signature est révoquée
it: Attenzione: la chiave di firma è revocata
ja: 警告: 署名キーが失効しています
ko: 경고: 서명 키가 폐기되었습니다
pt_br: Aviso: a chave de assinatura foi revogada
pt_pt: Aviso: a chave de assinatura foi revogada
ru: Предупреждение: ключ подписи отозван
uk: Попередження: ключ для підпису відкликано
zh_hans: 警告：签名密钥已被吊销

# gpg_tools_warning_policy_conflict
source: Warning: signing key has conflicting policy information
ar: تحذير: يحتوي مفتاح التوقيع على معلومات سياسة متعارضة
fr: Attention : la clé de signature a des informations de politique conflictuelles
pt_br: Aviso: a chave de assinatura contém informações de política conflitantes
pt_pt: Aviso: a chave de assinatura contém informações de política conflituantes

# gpg_tools_warning_signature_expired
source: Warning: signature is expired
ar: تحذير: التوقيع منتهي الصلاحية
de: Warnung: Signatur ist abgelaufen
es: Advertencia: la firma ha caducado
fr: Avertissement : la signature a expiré
it: Attenzione: la firma è scaduta
ja: 警告: 署名の有効期限が切れています
ko: 경고: 서명이 만료되었습니다
pt_br: Aviso: a assinatura expirou
pt_pt: Aviso: a assinatura expirou
ru: Предупреждение: срок действия подписи истёк
uk: Попередження: термін дії підпису закінчився
zh_hans: 警告：签名已过期

# gpg_tools_warning_weak_digest
source: Warning: signature uses a weak digest algorithm
ar: تحذير: يستخدم التوقيع خوارزمية تجزئة ضعيفة
fr: Attention : la signature utilise un algorithme de hachage faible
pt_br: Aviso: a assinatura usa um algoritmo de resumo fraco
pt_pt: Aviso: a assinatura utiliza um algoritmo de resumo fraco

# gpg_tools_warning_weak_rsa_decryption_key
source: Warning: message was decrypted with a weak RSA key
ar: تحذير: تم فك تشفير الرسالة بمفتاح RSA ضعيف
fr: Attention : le message a été déchiffré avec une clé RSA faible
pt_br: Aviso: a mensagem foi descriptografada com uma chave RSA fraca
pt_pt: Aviso: a mensagem foi desencriptada com uma chave RSA fraca

# gpg_user_id_mutation_key_revoked_message
source: A revoked GPG key cannot be changed.
ar: لا يمكن تغيير مفتاح GPG المُبطَل.
fr: Une clé GPG révoquée ne peut pas être modifiée.
pt_br: Uma chave GPG revogada não pode ser alterada.
pt_pt: Uma chave GPG revogada não pode ser alterada.

# gpg_user_id_replacement_already_done_message
source: This replacement was already applied. No new signatures were created.
ar: تم تطبيق هذا الاستبدال بالفعل. لم تُنشأ توقيعات جديدة.
fr: Ce remplacement a déjà été appliqué. Aucune nouvelle signature n'a été créée.
pt_br: Esta substituição já foi aplicada. Nenhuma nova assinatura foi criada.
pt_pt: Essa substituição já foi aplicada. Nenhuma nova assinatura foi criada.

# gpg_user_id_replacement_confirm_next
source: Next
ar: التالي
fr: Suivant
pt_br: Próximo
pt_pt: Próximo

# gpg_user_id_replacement_dialog_message
source: Select the old User ID. Keyguard will add the replacement and revoke this exact User ID in one update.
ar: حدّد معرّف المستخدم القديم. سيضيف Keyguard البديل ويبطل هذا المعرّف بالتحديد في تحديث واحد.
fr: Sélectionnez l'ancien identifiant d'utilisateur. Keyguard le remplacera et le révoquera en une seule action.
pt_br: Selecione o ID de usuário antigo. O Keyguard adicionará a substituição e revogará esse ID de usuário exato em uma atualização.
pt_pt: Selecione o ID de utilizador antigo. O Keyguard irá adicionar o ID de utilizador substituto e revogará este ID de utilizador específico numa única atualização.

# gpg_user_id_replacement_dialog_title
source: Replace GPG User ID
ar: استبدال معرّف مستخدم GPG
fr: Remplacer l'identifiant utilisateur GPG
pt_br: Substituir ID de usuário GPG
pt_pt: Substituir ID de utilizador GPG

# gpg_user_id_replacement_duplicate_message
source: That User ID is already active on this key.
ar: معرّف المستخدم هذا نشط بالفعل على هذا المفتاح.
fr: Cet identifiant utilisateur est déjà actif sur cette clé.
pt_br: Esse ID de usuário já está ativo nesta chave.
pt_pt: Esse ID de utilizador já está ativo nessa chave.

# gpg_user_id_replacement_failed_message
source: The User ID could not be replaced. The original key was left unchanged.
ar: تعذّر استبدال معرّف المستخدم. تُرك المفتاح الأصلي دون تغيير.
fr: L'ID de l'utilisateur n'a pas pu être remplacé. La clé d'origine n'a pas été modifiée.
pt_br: O ID do usuário não pôde ser substituído. A chave original permaneceu inalterada.
pt_pt: O ID do utilizador não pôde ser substituído. A chave original permaneceu inalterada.

# gpg_user_id_replacement_failed_title
source: Failed to replace GPG User ID
ar: فشل استبدال معرّف مستخدم GPG
fr: Impossible de remplacer l'identifiant utilisateur GPG
pt_br: Falha ao substituir o ID de usuário GPG
pt_pt: Falha ao substituir o ID de utilizador GPG

# gpg_user_id_replacement_invalid_message
source: Enter a non-empty User ID of at most 1024 UTF-8 bytes without control characters.
ar: أدخل معرّف مستخدم غير فارغ بحجم 1024 بايت UTF-8 كحد أقصى ودون أحرف تحكم.
fr: Entrez un identifiant utilisateur non vide d'au plus 1024 octets UTF-8 sans caractères de contrôle.
pt_br: Insira uma ID de usuário não vazia de no máximo 1.024 bytes UTF-8 sem caracteres de controle.
pt_pt: Introduza um ID de utilizador não vazio de um máximo de 1024 bytes UTF-8, sem caracteres de controlo.

# gpg_user_id_replacement_no_identity_message
source: This key has no active User ID that can be replaced.
ar: لا يحتوي هذا المفتاح على معرّف مستخدم نشط يمكن استبداله.
fr: Cette clé n'a pas d'identifiant utilisateur actif remplaçable.
pt_br: Esta chave não possui ID de usuário ativo que possa ser substituído.
pt_pt: Esta chave não tem um ID de utilizador ativo que possa ser substituído.

# gpg_user_id_replacement_private_key_required
source: Import the private key to replace one of its User IDs.
ar: استورد المفتاح الخاص لاستبدال أحد معرّفات المستخدم الخاصة به.
fr: Importez la clé privée pour remplacer l'un de ses identifiants utilisateur.
pt_br: Importe a chave privada para substituir um de seus IDs de usuário.
pt_pt: Importe a chave privada para substituir um dos IDs de utilizador.

# gpg_user_id_replacement_retired_message
source: That exact User ID was previously revoked and cannot be added again.
ar: تم إبطال معرّف المستخدم هذا بالتحديد سابقًا ولا يمكن إضافته مرة أخرى.
fr: Cet identifiant d'utilisateur exact a été précédemment révoqué et ne peut pas être ajouté à nouveau.
pt_br: Esse ID de usuário exato foi revogado anteriormente e não pode ser adicionado novamente.
pt_pt: Este ID de utilizador específico foi revogado anteriormente e não pode ser adicionado novamente.

# gpg_user_id_replacement_same_identity_message
source: Enter a User ID different from the selected identity.
ar: أدخل معرّف مستخدم مختلفًا عن الهوية المحددة.
fr: Entrez un identifiant utilisateur différent de l'identité sélectionnée.
pt_br: Insira um ID de usuário diferente da identidade selecionada.
pt_pt: Introduza um ID de utilizador diferente da identidade selecionada.

# gpg_user_id_replacement_success_message
source: Save this item, then redistribute or upload its public key to publish the replacement.
ar: احفظ هذا العنصر، ثم أعد توزيع مفتاحه العام أو ارفعه لنشر الاستبدال.
fr: Enregistrez cet élément, puis redistribuez ou téléversez sa clé publique pour publier le remplacement.
pt_br: Salve este item e redistribua ou carregue sua chave pública para publicar a substituição.
pt_pt: Guarde este item e, em seguida, redistribua-o ou carregue a sua chave pública para publicar a versão de substituição.

# gpg_user_id_replacement_success_title
source: GPG User ID replaced
ar: تم استبدال معرّف مستخدم GPG
fr: Identifiant utilisateur GPG remplacé
pt_br: ID de usuário GPG substituído
pt_pt: ID de utilizador GPG substituída

# gpg_user_id_replacement_target_missing
source: The selected User ID changed or is no longer active. Reopen the key and try again.
ar: تغيّر معرّف المستخدم المحدد أو لم يعد نشطًا. أعد فتح المفتاح وحاول مرة أخرى.
fr: L'identifiant utilisateur sélectionné a changé ou n'est plus actif. Réouvrez la clé et réessayez.
pt_br: O ID do usuário selecionado foi alterado ou não está mais ativo. Reabra a chave e tente novamente.
pt_pt: O ID de utilizador selecionado foi alterado ou já não está ativo. Volte a abrir a chave e tente novamente.

# gpg_user_id_replacement_title
source: Replace User ID
ar: استبدال معرّف المستخدم
fr: Remplacer l'identifiant utilisateur
pt_br: Substituir ID do Usuário
pt_pt: Substituir ID do utilizador

# gpg_user_id_replacement_unavailable
source: GPG User-ID replacement is not supported on this platform.
ar: استبدال معرّف مستخدم GPG غير مدعوم على هذه المنصة.
fr: Le remplacement de l'identifiant utilisateur GPG n'est pas pris en charge sur cette plateforme.
pt_br: A substituição do ID do usuário GPG não é suportada nesta plataforma.
pt_pt: A substituição de IDs de utilizador GPG não é suportada nesta plataforma.

# gpg_user_id_replacement_value_confirm
source: Replace
ar: استبدال
fr: Remplacer
pt_br: Substituir
pt_pt: Substituir

# gpg_user_id_replacement_value_hint
source: Name <email@example.com>
ar: الاسم <email@example.com>
fr: Nommer <email@example.com>
pt_br: Nome <email@example.com>
pt_pt: Nome <email@example.com>

# gpg_user_id_replacement_value_label
source: User ID
ar: معرّف المستخدم
fr: Identifiant utilisateur
pt_br: ID do Usuário
pt_pt: ID do utilizador

# gpg_user_id_replacement_value_message
source: Enter the exact new OpenPGP User ID. Keyguard will not trim or normalize it.
ar: أدخل معرّف مستخدم OpenPGP الجديد بدقة. لن يقوم Keyguard بإزالة الفراغات أو توحيده.
fr: Entrez le nouvel identifiant d'utilisateur OpenPGP tel quel. Keyguard ne le rognera pas ni le normalisera.
pt_br: Insira a nova ID de usuário OpenPGP exato. O Keyguard não irá cortá-la ou normalizá-la.
pt_pt: Introduza o novo ID de utilizador OpenPGP exatamente como está. O Keyguard não irá truncar nem normalizar o ID.
